import React from "react";

const page = () => {
  return (
    <section className="section info-page section-bg  z-index-1">
      <img
        src="/images/banner-gradient.png"
        alt=""
        className="bg--gradient white-version"
      />

      <img src="/images/element-moon1.png" alt="" className="element one" />
      <img src="/images/element-moon2.png" alt="" className="element two" />

      <div className="container container-two">
        <h1 className="section-heading heading ">
          الشروط والأحكام - متجر ماجك ستور
        </h1>
        <p>
          تنطبق هذه الشروط والأحكام ("الشروط والأحكام") على المتجر الإلكتروني
          وعلى جميع أقسامها وفروعها ومواقع الإنترنت التابعة لها التي تُشير إلى
          هذه الشروط والأحكام كمرجعٍ لها.
        </p>

        <p>
          عند زيارة الموقع، يقر العميل موافقته على الشروط والأحكام الحالية. وإن
          كنت لا توافق عليها، فعليك عدم استخدام هذا الموقع. ويحتفظ القائمون على
          الموقع بالحق في تغيير أجزاء من شروط الاستخدام والأحكام أو تعديلها أو
          إضافة معلومات إليها، أو إزالتها في أي وقت.
        </p>

        <h2>شروط وأحكام الاستخدام:</h2>

        <h3>استخدام الموقع</h3>
        <ul>
          <li>
            1. لزيارة هذا الموقع، يجب ألا يقل عمرك عن 18 عامًا أو أن تزور الموقع
            تحت إشراف.
          </li>
          <li>
            2. تتطلب بعض الخدمات والميزات ذات الصلة التي قد تكون متوفرة على
            الموقع التسجيل أو الاشتراك فيها. وباختيارك التسجيل أو الاشتراك،
            فإنَّك توافق على تقديم معلومات دقيقة وحالية عن نفسك وعلى تحديثها إذا
            طرأت أيّة تغييرات عليها.
          </li>
          <li>
            3. أثناء عملية التسجيل، يوافق العميل على تلقِّي رسائل إلكترونية
            ترويجية من قِبل الموقع. ويمكنك، في وقت لاحق، إلغاء هذا الخيار.
          </li>
        </ul>

        <h3>مشاركات المستخدم</h3>
        <p>
          إنّ كلّ مشاركاتك على الموقع و/أو ما تقدمه لنا، بما في ذلك الأسئلة
          والانتقادات والتعليقات والاقتراحات (مجتمعين في لفظة "المشاركات") تصبح
          ملكنا الوحيد والحصري، ولا تعود بأي حالٍ من الأحوال ملكًا لك. وبمجرَّد
          أنَّك تشاركنا بتعليقاتك أو انتقاداتك على الموقع، فإنَّك تمنحنا أيضًا
          حقّ استخدام الاسم الذي تعرضه والمرتبط مباشرةً بهذا النقد أو التعليق أو
          أي محتوى آخر. ولا يحق لك استخدام عنوان مزيَّف للبريد الإلكتروني أو
          الادِّعاء بأنّك شخصٌ آخر. ويجوز لنا حذف أيّ من المشاركات أو تعديلها.
        </p>

        <h3>الموافقة على الطلبات وتفاصيل الأسعار</h3>
        <p>
          نحرص على توفير أدق المعلومات المتعلقة بالأسعار لجميع المستخدمين الذين
          يزورون الموقع. وفي حالة ما إذا لم يتم تحديد سعر المنتج بشكلٍ صحيح،
          فيحق لنا، وفقًا لتقديرنا الخاص، الاتصال بك للحصول على تعليماتٍ أو
          إلغاء طلبك وإبلاغك بهذا الإلغاء. ولنا الحق في رفض أو إلغاء أي طلبات
          سواء تمّ تأكيدها أو لا.
        </p>

        <h3>العلامات التجارية وحقوق النشر</h3>
        <p>
          إنَّ جميع حقوق الملكية الفكرية، سواء كانت مسجلَّة أو غير مسجلَّة، في
          الموقع، وجميع معلومات المحتوى والتصميمات الواردة على الموقع، تعتبر
          ملكًا لنا، وإنّ كلّ محتويات الموقع محميةٌ أيضًا بموجب حقوق النشر
          مجتمعة في صورة عمل واحد وفقًا لقوانين حقوق النشر في المملكة العربية
          السعودية والاتفاقيات الدولية. جميع الحقوق محفوظة. ماجيك ستور
        </p>
      </div>
    </section>
  );
};

export default page;
