import React from "react";

const page = () => {
  return (
    <section className=" section info-page  ">
      <div className="container">
        <img
          src="/images/banner-gradient.png"
          alt=""
          className="bg--gradient white-version"
        />

        <img src="/images/element-moon1.png" alt="" className="element one" />
        <img src="/images/element-moon2.png" alt="" className="element two" />

        <h1 className="section-heading heading">سياسة الخصوصية - متجر بيارق</h1>

        <p>
          نحترم خصوصية جميع المعلومات المسجلة لدى متجر ماجك ستور، ونعمل جاهدين
          على حمايتها. فيما يلي توضيح لكيفية التعامل مع المعلومات الخاصة بكم:
        </p>

        <h2>ما هي المعلومات التي يحصل عليها المتجر؟</h2>
        <ul>
          <li>
            1. المعلومات الشخصية الخاصة بالمستخدم، مثل: الاسم، العمر، والبريد
            الإلكتروني.
          </li>
          <li>
            2. معلومات الدخول الشخصية الخاصة بالمستخدم، مثل: اسم المستخدم، كلمة
            السر، والبريد الإلكتروني.
          </li>
          <li>
            3. معلومات متعلقة بالكوكيز (ملفات الارتباط) لأغراض تسهيل التفاعل بين
            المتجر والمستخدم.
          </li>
        </ul>

        <h2>هل المتجر يشارك هذه المعلومات؟</h2>
        <p>
          نحن ملتزمون بالحفاظ على خصوصية المستخدمين. لا يتم الاحتفاظ بالمعلومات
          إلا لتحسين جودة المتجر وتسهيل التفاعل بين المتجر والمستخدم، ولا يطلع
          عليها إلا القائمون على المتجر.
        </p>

        <h2>ما هو مدى أمان سرية المعلومات الخاصة بالمتجر؟</h2>
        <p>
          نحرص على الحفاظ على جميع المعلومات الخاصة بالمستخدمين وعدم السماح لأحد
          بالاطلاع عليها بما يخالف هذه السياسة.
        </p>

        <h2>ما مدى سرية الدفع الإلكتروني؟</h2>
        <p>
          لا يحتفظ المتجر بأي معلومات لبطاقات العملاء الائتمانية؛ حيث يتم
          تشفيرها وتوجيهها بشكل مباشر للبنك ووسيط الدفع بتصريح من مؤسسة النقد
          السعودي، دون إمكانية وصول المتجر إليها.
        </p>

        <h2>كيف أوافق/أعترض على سياسة الخصوصية؟</h2>
        <p>
          تصفحك واستخدامك لخدمات المتجر يعني موافقتك على جمع المعلومات
          واستخدامها حسب هذه السياسة. في حال الاعتراض، يُرجى عدم استخدام الموقع.
        </p>

        <p>
          قد نقوم بإجراء تغييرات على سياسة الخصوصية، لذا يُنصح بالاطلاع عليها
          بشكل دوري.
        </p>
      </div>
    </section>
  );
};

export default page;
